acl
ada
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-lib
alsa-topology-conf
alsa-ucm-conf
aom
archlinux-keyring
at-spi2-core
attr
audit
autoconf
automake
avahi
base
base-devel
bash
bat
binutils
bison
blas
boost
boost-libs
brotli
btop
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cblas
cmake
comgr
composable-kernel
containerd
coreutils
cppdap
cronie
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
docker
docker-buildx
double-conversion
duktape
e2fsprogs
ex-vi-compat
expat
fakeroot
file
filesystem
findutils
flac
flex
fmt
fontconfig
freetype2
fribidi
fzf
gawk
gc
gcc
gcc-libs
gdbm
gdk-pixbuf2
gettext
gflags
giflib
git
glib-networking
glib2
glibc
glow
glu
glycin
gmp
gnulib-l10n
gnupg
gnutls
google-glog
gperftools
gpgme
gpm
graphite
grep
groff
gsettings-desktop-schemas
gsettings-system-schemas
gtest
gtk-update-icon-cache
gtk3
guile
gvim
gzip
harfbuzz
hicolor-icon-theme
hidapi
highway
hip-runtime-amd
hipblas
hipblas-common
hipblaslt
hipcub
hipfft
hiprand
hipsolver
hipsparse
hsa-rocr
hwdata
hwloc
iana-etc
icu
imv
inotify-tools
iproute2
iptables
iputils
iso-codes
jansson
jbigkit
json-c
json-glib
jsoncpp
kbd
keychain
keyutils
kmod
krb5
l-smash
lame
lapack
lcms2
leancrypto
less
libarchive
libasan
libassuan
libasyncns
libatomic
libb2
libbpf
libcanberra
libcap
libcap-ng
libcloudproviders
libcolord
libcups
libdaemon
libdatrie
libde265
libdeflate
libdrm
libedit
libelf
libepoxy
libevdev
libevent
libfabric
libffi
libgcc
libgcrypt
libgfortran
libgit2
libglvnd
libgomp
libgpg-error
libgudev
libheif
libice
libidn2
libinih
libinput
libisl
libjpeg-turbo
libjxl
libksba
libldap
liblsan
libluv
libmakepkg-dropins
libmnl
libmpc
libnetfilter_conntrack
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnl
libnsbmp
libnsgif
libnsl
libobjc
libogg
libp11-kit
libpcap
libpciaccess
libpipeline
libpng
libproxy
libpsl
libpulse
libquadmath
librsvg
libsasl
libseccomp
libsecret
libsm
libsndfile
libsoup3
libssh2
libstdc++
libstemmer
libsysprof-capture
libtasn1
libthai
libtiff
libtirpc
libtool
libtsan
libubsan
libunistring
libunwind
libusb
libutf8proc
libuv
libverto
libvorbis
libvterm
libwacom
libwebp
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcursor
libxdamage
libxdmcp
libxext
libxfixes
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxml2
libxmu
libxrandr
libxrender
libxshmfence
libxss
libxt
libxtst
libxxf86vm
libyaml
licenses
linux-api-headers
llhttp
llvm-libs
lm_sensors
lmdb
lsd
lsof
lua
lua51-lpeg
luajit
lz4
lzo
m4
make
man-db
md4c
mesa
miopen-hip
mpdecimal
mpfr
mpg123
msgpack-c
msgpack-cxx
mtdev
ncurses
neovim
nettle
nftables
nmap
node-gyp
nodejs
nodejs-nopt
npm
npth
nspr
nss
numactl
ocl-icd
oniguruma
opencl-headers
openh264
openmp
openmpi
openpmix
openssh
openssl
openucx
opus
p11-kit
pacman
pacman-mirrorlist
pam
pambase
pango
paru
paru-debug
patch
pciutils
pcre2
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pixman
pkgconf
popt
procps-ng
prrte
psmisc
python
python-attrs
python-cffi
python-cryptography
python-filelock
python-packaging
python-pip
python-prettytable
python-pyaml
python-pycparser
python-pyelftools
python-wcwidth
python-wheel
python-yaml
qoi
qt5-base
qt5-translations
qt6-base
qt6-translations
rccl
readline
rhash
ripgrep
rocalution
rocblas
rocfft
rocm-cmake
rocm-core
rocm-device-libs
rocm-hip-libraries
rocm-hip-runtime
rocm-hip-sdk
rocm-language-runtime
rocm-llvm
rocm-opencl-runtime
rocm-opencl-sdk
rocm-smi-lib
rocminfo
rocprim
rocprofiler-register
rocrand
rocsolver
rocsparse
rocthrust
roctracer
run-parts
runc
rustup
sdl2-compat
sdl3
sed
semver
shadow
shared-mime-info
simdjson
sound-theme-freedesktop
spirv-tools
sqlite
strace
sudo
suitesparse
systemd
systemd-libs
systemd-sysvcompat
tar
tdb
texinfo
tinysparql
tpm2-tss
tree
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-jetbrains-mono-nerd
ttf-liberation
tzdata
unibilium
unzip
util-linux
util-linux-libs
vim-runtime
vulkan-icd-loader
vulkan-tools
wayland
which
x264
x265
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-utils
xkeyboard-config
xorg-xprop
xorgproto
xxhash
xz
yaml-cpp
zip
zlib
zlib-ng
zsh
zstd
