ada
aom
autoconf
automake
base
base-devel
bat
bison
blas
boost
boost-libs
btop
c-ares
cblas
clang
cmake
comgr
composable-kernel
cppdap
cronie
db5.3
debugedit
diffutils
docker
docker-buildx
docker-compose
double-conversion
ex-vi-compat
fakeroot
flex
fmt
fzf
gc
gcc
gflags
git
glow
glu
google-glog
groff
guile
gvim
hidapi
hip-runtime-amd
hipblas
hipblas-common
hipblaslt
hipcub
hipfft
hiprand
hipsolver
hipsparse
hsa-rocr
hwloc
imv
inotify-tools
jsoncpp
keychain
l-smash
lapack
less
libb2
libde265
libevdev
libfabric
libgit2
libgudev
libheif
libinih
libinput
libisl
libluv
libmpc
libnsbmp
libnsgif
libpipeline
libutf8proc
libuv
libvterm
libwacom
libxkbcommon-x11
libxmu
libxss
libyaml
llhttp
lsd
lsof
lua
lua51-lpeg
luajit
m4
make
man-db
md4c
miopen-hip
mpdecimal
msgpack-c
msgpack-cxx
mtdev
neovim
nftables
nmap
node-gyp
nodejs
nodejs-nopt
npm
nspr
nss
numactl
ocl-icd
oniguruma
opencl-headers
openh264
openmp
openmpi
openpmix
openssh
openucx
patch
perl
perl-error
perl-mailtools
perl-timedate
pkgconf
prrte
python
python-attrs
python-cffi
python-cryptography
python-filelock
python-packaging
python-pip
python-prettytable
python-pyaml
python-pycparser
python-pyelftools
python-wcwidth
python-wheel
python-yaml
qt5-base
qt5-translations
qt6-base
qt6-translations
rccl
rhash
ripgrep
rocalution
rocblas
rocfft
rocm-cmake
rocm-core
rocm-device-libs
rocm-hip-libraries
rocm-hip-runtime
rocm-hip-sdk
rocm-language-runtime
rocm-llvm
rocm-opencl-runtime
rocm-opencl-sdk
rocm-smi-lib
rocminfo
rocprim
rocprofiler-register
rocrand
rocsolver
rocsparse
rocthrust
roctracer
rustup
sdl2-compat
sdl3
semver
simdjson
strace
sudo
suitesparse
texinfo
tmux
tree
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-jetbrains-mono-nerd
ttf-liberation
unibilium
unzip
vulkan-icd-loader
vulkan-tools
which
x264
x265
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-utils
xxhash
yaml-cpp
zip
zlib-ng
zsh
